In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [4]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = np.nan

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [20]:
df.iloc[:4, 1] = np.nan

In [21]:
df.iloc[:2, 2] = np.nan

In [22]:
df

          0         1         2
0  0.519548       NaN       NaN
1  0.368142       NaN       NaN
2  0.383736       NaN  0.970744
3  0.167220       NaN  0.599779
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [23]:
df.dropna()

          0         1         2
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [24]:
df.dropna(thresh=2)

          0         1         2
2  0.383736       NaN  0.970744
3  0.167220       NaN  0.599779
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [25]:
df.fillna(0)

          0         1         2
0  0.519548  0.000000  0.000000
1  0.368142  0.000000  0.000000
2  0.383736  0.000000  0.970744
3  0.167220  0.000000  0.599779
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [26]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [27]:
df.iloc[2:, 1] = np.nan

In [28]:
df.iloc[4:, 2] = np.nan

In [29]:
df

          0         1         2
0  1.489415 -0.637787  0.407267
1 -0.232867 -1.149500  0.218578
2  0.281978       NaN  0.310579
3  0.933828       NaN -1.166014
4 -0.396223       NaN       NaN
5  1.534780       NaN       NaN

In [30]:
df.fillna(method="ffill")

          0         1         2
0  1.489415 -0.637787  0.407267
1 -0.232867 -1.149500  0.218578
2  0.281978 -1.149500  0.310579
3  0.933828 -1.149500 -1.166014
4 -0.396223 -1.149500 -1.166014
5  1.534780 -1.149500 -1.166014

In [31]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  1.489415 -0.637787  0.407267
1 -0.232867 -1.149500  0.218578
2  0.281978 -1.149500  0.310579
3  0.933828 -1.149500 -1.166014
4 -0.396223       NaN -1.166014
5  1.534780       NaN -1.166014

In [32]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [33]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [34]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [35]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
   ....:                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [36]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [39]:
data["v1"]=range(7)

In [40]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [43]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
   ....:                               "pastrami", "corned beef", "bacon",
   ....:                               "pastrami", "honey ham", "nova lox"],
   ....:                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [45]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [47]:
data["animal"]=data['food'].map(meat_to_animal)

In [48]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
def get_animal(x):
   ....:     return meat_to_animal[x]

In [50]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object